tqlblzj/arduino-gd32/hardware/gd32w/1.0.0/variants/GD32VW553_EVAL_MD1/PeripheralPins.c
/* mbed Microcontroller Library
 * Copyright (c) 2018 GigaDevice Semiconductor Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#include "PeripheralPins.h"

/*  void pin_function(PinName pin, int function);
    configure the speed, mode,and afio function of pins
    the parameter function contains the configuration information,show as below
    bit 0:2   gpio mode
    bit 3:8   remap
    bit 9:10  gpio speed
    bit 11:15 adc  /timer channel
*/
const int GD_GPIO_AF[] = {
    GPIO_AF_0    ,
    GPIO_AF_1    ,
    GPIO_AF_2    ,
    GPIO_AF_3    ,
    GPIO_AF_4    ,
    GPIO_AF_5    ,
    GPIO_AF_6    ,
    GPIO_AF_7    ,
    GPIO_AF_8    ,
    GPIO_AF_9    ,
    GPIO_AF_10   ,
    GPIO_AF_11   ,
    GPIO_AF_12   ,
    GPIO_AF_13   ,
    GPIO_AF_14   ,
    GPIO_AF_15   ,
};

/* GPIO OUTPUT MODE */
const int GD_GPIO_MODE[] = {
    GPIO_MODE_INPUT,
    GPIO_MODE_OUTPUT,
    GPIO_MODE_AF,
    GPIO_MODE_ANALOG,
};

/* GPIO OUTPUT TYPE */
const int GD_GPIO_OUTPUT_TYPE[] = {
    GPIO_OTYPE_PP,
    GPIO_OTYPE_OD,
};

/* GPIO SPEED */
const int GD_GPIO_SPEED[] = {
    GPIO_OSPEED_MAX,              /* 0 */
    GPIO_OSPEED_25MHZ,            /* 1 */
    GPIO_OSPEED_10MHZ,            /* 2 */
    GPIO_OSPEED_2MHZ,             /* 3 */
};

const int GD_PULL_UP_DOWN[] = {
    GPIO_PUPD_NONE,               /* 0 */
    GPIO_PUPD_PULLUP,             /* 1 */
    GPIO_PUPD_PULLDOWN,           /* 2 */
};

const PinMap PinMap_ADC[] = {
    {PORTA_0, ADC, GD_PIN_FUNCTION6(PIN_MODE_ANALOG, PIN_OSPEED_25MHZ, PIN_PUPD_NONE, PIN_OTYPE_OD, 0)},    /* ADC0_IN0 */
    {PORTA_1, ADC, GD_PIN_FUNCTION6(PIN_MODE_ANALOG, PIN_OSPEED_25MHZ, PIN_PUPD_NONE, PIN_OTYPE_OD, 1)},    /* ADC0_IN1 */
    {PORTA_2, ADC, GD_PIN_FUNCTION6(PIN_MODE_ANALOG, PIN_OSPEED_25MHZ, PIN_PUPD_NONE, PIN_OTYPE_OD, 2)},    /* ADC0_IN2 */
    {PORTA_3, ADC, GD_PIN_FUNCTION6(PIN_MODE_ANALOG, PIN_OSPEED_25MHZ, PIN_PUPD_NONE, PIN_OTYPE_OD, 3)},    /* ADC0_IN3 */
    {PORTA_4, ADC, GD_PIN_FUNCTION6(PIN_MODE_ANALOG, PIN_OSPEED_25MHZ, PIN_PUPD_NONE, PIN_OTYPE_OD, 4)},    /* ADC0_IN4 */
    {PORTA_5, ADC, GD_PIN_FUNCTION6(PIN_MODE_ANALOG, PIN_OSPEED_25MHZ, PIN_PUPD_NONE, PIN_OTYPE_OD, 5)},    /* ADC0_IN5 */
    {PORTA_6, ADC, GD_PIN_FUNCTION6(PIN_MODE_ANALOG, PIN_OSPEED_25MHZ, PIN_PUPD_NONE, PIN_OTYPE_OD, 6)},    /* ADC0_IN6 */
    {PORTA_7, ADC, GD_PIN_FUNCTION6(PIN_MODE_ANALOG, PIN_OSPEED_25MHZ, PIN_PUPD_NONE, PIN_OTYPE_OD, 7)},    /* ADC0_IN7 */
    {PORTB_0, ADC, GD_PIN_FUNCTION6(PIN_MODE_ANALOG, PIN_OSPEED_25MHZ, PIN_PUPD_NONE, PIN_OTYPE_OD, 8)},    /* ADC0_IN8 */
    {NC,   NC,    0}
};


/* I2C PinMap */
const PinMap PinMap_I2C_SDA[] = {
    {PORTA_3,  I2C0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_OD, PIN_AF_4)},
    {PORTA_8,  I2C0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_OD, PIN_AF_5)},
    {PORTB_1,  I2C0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_OD, PIN_AF_6)},

    {PORTA_7,  I2C1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_OD, PIN_AF_0)},
    {PORTA_14, I2C1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_OD, PIN_AF_6)},
    {PORTB_13, I2C1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_OD, PIN_AF_6)},
    {PORTC_8,  I2C1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_OD, PIN_AF_6)},

    {NC,    NC,    0}
};

const PinMap PinMap_I2C_SCL[] = {
    {PORTA_2,  I2C0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_OD, PIN_AF_4)},
    {PORTB_0,  I2C0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_OD, PIN_AF_6)},
    {PORTB_15, I2C0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_OD, PIN_AF_4)},

    {PORTA_6,  I2C1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_OD, PIN_AF_4)},
    {PORTA_13, I2C1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_OD, PIN_AF_6)},
    {PORTA_15, I2C1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_OD, PIN_AF_6)},
    {PORTB_12, I2C1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_OD, PIN_AF_6)},

    {NC,    NC,    0}
};

/* PWM PinMap */
const PinMap PinMap_PWM[] = {
    // Timer0 CH0
    {PORTA_2 , TIMER0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_MAX, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_6)},
    {PORTA_8 , TIMER0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_MAX, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_1)},

    // Timer0 CH1
    {PORTA_4, TIMER0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_MAX, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_8)},
    {PORTA_6, TIMER0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_MAX, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_8)},
    {PORTA_9, TIMER0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_MAX, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_1)},

    // Timer0 CH2
    {PORTA_10, TIMER0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_MAX, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_1)},
    {PORTB_0, TIMER0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_MAX, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_3)},

    // Timer0 CH3
    {PORTA_11, TIMER0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_MAX, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_1)},
    {PORTB_12, TIMER0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_MAX, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_2)},

    // Timer1 CH0
    {PORTA_0, TIMER1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_MAX, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_1)},
    {PORTA_15, TIMER1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_MAX, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_1)},
    {PORTB_4, TIMER1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_MAX, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_1)},

    // Timer1 CH1
    {PORTA_1, TIMER1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_MAX, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_1)},
    {PORTB_3, TIMER1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_MAX, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_1)},

    // Timer1 CH2
    {PORTA_7, TIMER1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_MAX, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_9)},
    {PORTA_12, TIMER1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_MAX, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_9)},
    {PORTB_11, TIMER1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_MAX, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_1)},

    // Timer1 CH3
    {PORTA_3, TIMER1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_MAX, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_1)},
    {PORTB_2, TIMER1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_MAX, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_1)},
    {PORTB_13, TIMER1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_MAX, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_3)},

    {NC,    NC,    0}
};

/* USART PinMap */
const PinMap PinMap_UART_TX[] = {
    {PORTA_0,   USART0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_3)},
    {PORTA_9,   USART0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_7)},
    {PORTB_4,   USART0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_7)},
    {PORTC_8,   USART0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_7)},

    {PORTA_2,  UART1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_7)},
    {PORTA_4,  UART1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_0)},
    {PORTB_0,  UART1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_4)},
    {PORTB_3,  UART1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_8)},
    {PORTB_15,  UART1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_7)},

    {PORTA_6,   UART2,  GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_10)},  //Arduino serial tx
    {NC,    NC,     0}
};

const PinMap PinMap_UART_RX[] = {
    {PORTA_1,  USART0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_0)},
    {PORTA_10,  USART0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_8)},
    {PORTA_15,  USART0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_7)},
    {PORTB_3,  USART0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_7)},

    {PORTA_3,  UART1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_7)},
    {PORTA_5,  UART1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_0)},
    {PORTA_8,  UART1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_3)},
    {PORTB_1,  UART1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_4)},
    {PORTA_4,  UART1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_8)},

    {PORTA_7,  UART2, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_8)},  //Arduino serial rx
    {NC,    NC,     0}
};

const PinMap PinMap_UART_RTS[] = {
    {PORTA_2, USART0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_0)},
    {PORTA_13, USART0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_7)},

    {PORTA_1,  UART1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_7)},
    {PORTA_14,  UART1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_8)},
    {PORTA_1,  UART1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_7)},

    {PORTB_1,  UART2, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_10)},
    {NC,    NC,    0}
};

const PinMap PinMap_UART_CTS[] = {
    {PORTA_3, USART0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_0)},
    {PORTA_14, USART0, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_7)},

    {PORTA_0,  UART1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_7)},
    {PORTB_11,  UART1, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_8)},

    {PORTB_0,  UART2, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_PULLUP, PIN_OTYPE_PP, PIN_AF_10)},
    {NC,    NC,    0}
};

/* SPI PinMap */
const PinMap PinMap_SPI_MOSI[] = {
    {PORTA_0,  SPI, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_NONE, PIN_OTYPE_PP, PIN_AF_5)},
    {PORTA_7,  SPI, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_NONE, PIN_OTYPE_PP, PIN_AF_5)},
    {PORTA_9,  SPI, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_NONE, PIN_OTYPE_PP, PIN_AF_0)},
    {NC,    NC,    0}
};

const PinMap PinMap_SPI_MISO[] = {
    {PORTA_1,  SPI, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_NONE, PIN_OTYPE_PP, PIN_AF_5)},
    {PORTA_6,  SPI, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_NONE, PIN_OTYPE_PP, PIN_AF_5)},
    {PORTA_10,  SPI, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_NONE, PIN_OTYPE_PP, PIN_AF_0)},
    {NC,    NC,    0}
};

const PinMap PinMap_SPI_SCLK[] = {
    {PORTA_2,  SPI, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_NONE, PIN_OTYPE_PP, PIN_AF_5)},
    {PORTA_5,  SPI, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_NONE, PIN_OTYPE_PP, PIN_AF_5)},
    {PORTA_11,  SPI, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_NONE, PIN_OTYPE_PP, PIN_AF_0)},
    {NC,    NC,    0}
};

const PinMap PinMap_SPI_SSEL[] = {
    {PORTA_3,  SPI, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_NONE, PIN_OTYPE_PP, PIN_AF_5)},
    {PORTA_4,  SPI, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_NONE, PIN_OTYPE_PP, PIN_AF_5)},
    {PORTA_12,  SPI, GD_PIN_FUNCTION5(PIN_MODE_AF, PIN_OSPEED_25MHZ, PIN_PUPD_NONE, PIN_OTYPE_PP, PIN_AF_6)},
    {NC,    NC,    0}
};



const uint32_t gpio_port[] = {
    GPIOA,
    GPIOB,
    GPIOC,
};

const uint32_t gpio_pin[] = {
    GPIO_PIN_0,
    GPIO_PIN_1,
    GPIO_PIN_2,
    GPIO_PIN_3,
    GPIO_PIN_4,
    GPIO_PIN_5,
    GPIO_PIN_6,
    GPIO_PIN_7,
    GPIO_PIN_8,
    GPIO_PIN_9,
    GPIO_PIN_10,
    GPIO_PIN_11,
    GPIO_PIN_12,
    GPIO_PIN_13,
    GPIO_PIN_14,
    GPIO_PIN_15
};
